/*****************************************************************************
 *
 * モジュール:  app_router.c
 *
 * 概要: ルータアプリケーションの公開インタフェース
 *
 *****************************************************************************/

#ifndef APP_ROUTER_H_
#define APP_ROUTER_H_

/****************************************************************************/
/***        グローバル関数                                                                                                                         ***/
/****************************************************************************/
PUBLIC void APP_vInitialiseRouter(void);
PUBLIC void APP_vtaskRouter(void);
PUBLIC void SendData(void);

/****************************************************************************/
/***        グローバル変数                                                                                                                         ***/
/****************************************************************************/
PUBLIC uint8 u8SecondTimer;
PUBLIC uint8 u8RouteRecoveryTimer;

#endif /*APP_ROUTER_H_*/
